zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_spi.h
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_spi.h
  * @author  FMSH Application Team
  * @brief   Head file of SPI FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_SPI_H
#define __FM33FG0XXA_FL_SPI_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup SPI_FL_ES_INIT SPI Exported Init structures
  * @{
  */

/**
  * @brief FL SPI Init Sturcture definition
  */
typedef struct
{
    /*! 传输模式 单双工 */
    uint32_t transferMode;
    /*! 主从模式 */
    uint32_t mode;
    /*! 数据位宽 */
    uint32_t dataWidth;
    /*! 时钟极性 */
    uint32_t clockPolarity;
    /*! 时钟相位 */
    uint32_t clockPhase;
    /*! NSS 脚使能软件控制 */
    uint32_t softControl;
    /*! 通讯速率 */
    uint32_t baudRate;
    /*! Bit方向 */
    uint32_t bitOrder;

} FL_SPI_InitTypeDef;

typedef struct
{
    /*! I2S主从机模式 */
    uint32_t mode;
    /*! I2S标准选择*/
    uint32_t standard;
    /*! I2S通信长度*/
    uint32_t dataFormat;
    /*! I2S_MCLK输出使能*/
    FL_FunState mclkOutput;
    /*! I2S_音频采样频率*/
    uint32_t audioFreq;
    /*! I2S空闲时钟极性*/
    uint32_t clockPolarity;

} FL_I2S_InitTypeDef;

#define     FL_I2S_DATAFORMAT_16B                                 0x00000000U
#define     FL_I2S_DATAFORMAT_16B_EXTENDED                        (FL_I2S_VOCAL_TRACT_LENGTH_32BITS)
#define     FL_I2S_DATAFORMAT_24B                                 (FL_I2S_VOCAL_TRACT_LENGTH_32BITS | FL_I2S_DATA_LENGTH_24BITS)
#define     FL_I2S_DATAFORMAT_32B                                 (FL_I2S_VOCAL_TRACT_LENGTH_32BITS | FL_I2S_DATA_LENGTH_32BITS)

#define     FL_I2S_AUDIOFREQ_192K                                 192000U
#define     FL_I2S_AUDIOFREQ_96K                                  96000U
#define     FL_I2S_AUDIOFREQ_48K                                  48000U
#define     FL_I2S_AUDIOFREQ_44K                                  44100U
#define     FL_I2S_AUDIOFREQ_32K                                  32000U
#define     FL_I2S_AUDIOFREQ_22K                                  22050U
#define     FL_I2S_AUDIOFREQ_16K                                  16000U
#define     FL_I2S_AUDIOFREQ_11K                                  11025U
#define     FL_I2S_AUDIOFREQ_8K                                   8000U


#define     FL_I2S_STANDARD_PHILIPS                                FL_I2S_STANDARD_MODE_PHILIPS
#define     FL_I2S_STANDARD_MSB                                    FL_I2S_STANDARD_MODE_MSB_JUSTIFIED
#define     FL_I2S_STANDARD_LSB                                    FL_I2S_STANDARD_MODE_LSB_JUSTIFIED
#define     FL_I2S_STANDARD_PCM_SHORT                              (FL_I2S_STANDARD_MODE_PCM)
#define     FL_I2S_STANDARD_PCM_LONG                               (FL_I2S_STANDARD_MODE_PCM | FL_I2S_FRAME_SYNCHRONIZATION_LONG)

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup SPI_FL_Exported_Constants SPI Exported Constants
  * @{
  */

#define    SPI_CR1_IOSWAP_Pos                                     (11U)
#define    SPI_CR1_IOSWAP_Msk                                     (0x1U << SPI_CR1_IOSWAP_Pos)
#define    SPI_CR1_IOSWAP                                         SPI_CR1_IOSWAP_Msk

