zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_spi.h
#define    SPI_IER_RXIE_Pos                                       (0U)
#define    SPI_IER_RXIE_Msk                                       (0x1U << SPI_IER_RXIE_Pos)
#define    SPI_IER_RXIE                                           SPI_IER_RXIE_Msk

#define    SPI_ISR_DCN_TX_Pos                                     (12U)
#define    SPI_ISR_DCN_TX_Msk                                     (0x1U << SPI_ISR_DCN_TX_Pos)
#define    SPI_ISR_DCN_TX                                         SPI_ISR_DCN_TX_Msk

#define    SPI_ISR_RXCOL_Pos                                      (10U)
#define    SPI_ISR_RXCOL_Msk                                      (0x1U << SPI_ISR_RXCOL_Pos)
#define    SPI_ISR_RXCOL                                          SPI_ISR_RXCOL_Msk

#define    SPI_ISR_TXCOL_Pos                                      (9U)
#define    SPI_ISR_TXCOL_Msk                                      (0x1U << SPI_ISR_TXCOL_Pos)
#define    SPI_ISR_TXCOL                                          SPI_ISR_TXCOL_Msk

#define    SPI_ISR_BUSY_Pos                                       (8U)
#define    SPI_ISR_BUSY_Msk                                       (0x1U << SPI_ISR_BUSY_Pos)
#define    SPI_ISR_BUSY                                           SPI_ISR_BUSY_Msk

#define    SPI_ISR_CHSIDE_Pos                                     (7U)
#define    SPI_ISR_CHSIDE_Msk                                     (0x1U << SPI_ISR_CHSIDE_Pos)
#define    SPI_ISR_CHSIDE                                         SPI_ISR_CHSIDE_Msk

#define    SPI_ISR_MERR_Pos                                       (6U)
#define    SPI_ISR_MERR_Msk                                       (0x1U << SPI_ISR_MERR_Pos)
#define    SPI_ISR_MERR                                           SPI_ISR_MERR_Msk

#define    SPI_ISR_SERR_Pos                                       (5U)
#define    SPI_ISR_SERR_Msk                                       (0x1U << SPI_ISR_SERR_Pos)
#define    SPI_ISR_SERR                                           SPI_ISR_SERR_Msk

#define    SPI_ISR_SSNR_Pos                                       (4U)
#define    SPI_ISR_SSNR_Msk                                       (0x1U << SPI_ISR_SSNR_Pos)
#define    SPI_ISR_SSNR                                           SPI_ISR_SSNR_Msk

#define    SPI_ISR_SSNF_Pos                                       (3U)
#define    SPI_ISR_SSNF_Msk                                       (0x1U << SPI_ISR_SSNF_Pos)
#define    SPI_ISR_SSNF                                           SPI_ISR_SSNF_Msk

#define    SPI_ISR_TXSE_Pos                                       (2U)
#define    SPI_ISR_TXSE_Msk                                       (0x1U << SPI_ISR_TXSE_Pos)
#define    SPI_ISR_TXSE                                           SPI_ISR_TXSE_Msk

#define    SPI_ISR_TXBE_Pos                                       (1U)
#define    SPI_ISR_TXBE_Msk                                       (0x1U << SPI_ISR_TXBE_Pos)
#define    SPI_ISR_TXBE                                           SPI_ISR_TXBE_Msk

#define    SPI_ISR_RXBF_Pos                                       (0U)
#define    SPI_ISR_RXBF_Msk                                       (0x1U << SPI_ISR_RXBF_Pos)
#define    SPI_ISR_RXBF                                           SPI_ISR_RXBF_Msk

#define    FL_SPI_MASTER_SAMPLING_NORMAL                          (0x0U << SPI_CR1_MSPA_Pos)
#define    FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK                   (0x1U << SPI_CR1_MSPA_Pos)

#define    FL_SPI_SLAVE_SAMPLING_NORMAL                           (0x0U << SPI_CR1_SSPA_Pos)
#define    FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK                  (0x1U << SPI_CR1_SSPA_Pos)

#define    FL_SPI_WORK_MODE_SLAVE                                 (0x0U << SPI_CR1_MM_Pos)
#define    FL_SPI_WORK_MODE_MASTER                                (0x1U << SPI_CR1_MM_Pos)

#define    FL_SPI_SEND_WAIT_0                                     (0x0U << SPI_CR1_WAIT_Pos)
#define    FL_SPI_SEND_WAIT_1                                     (0x1U << SPI_CR1_WAIT_Pos)
#define    FL_SPI_SEND_WAIT_2                                     (0x2U << SPI_CR1_WAIT_Pos)
#define    FL_SPI_SEND_WAIT_3                                     (0x3U << SPI_CR1_WAIT_Pos)

#define    FL_SPI_CLK_DIV2                                        (0x0U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV4                                        (0x1U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV8                                        (0x2U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV16                                       (0x3U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV32                                       (0x4U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV64                                       (0x5U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV128                                      (0x6U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_CLK_DIV256                                      (0x7U << SPI_CR1_BAUD_Pos)

#define    FL_SPI_BAUDRATE_DIV2                                   (0x0U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV4                                   (0x1U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV8                                   (0x2U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV16                                  (0x3U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV32                                  (0x4U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV64                                  (0x5U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV128                                 (0x6U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_BAUDRATE_DIV256                                 (0x7U << SPI_CR1_BAUD_Pos)

#define    FL_SPI_BIT_ORDER_MSB_FIRST                             (0x0U << SPI_CR1_LSBF_Pos)
#define    FL_SPI_BIT_ORDER_LSB_FIRST                             (0x1U << SPI_CR1_LSBF_Pos)

#define    FL_SPI_POLARITY_NORMAL                                 (0x0U << SPI_CR1_CPOL_Pos)
#define    FL_SPI_POLARITY_INVERT                                 (0x1U << SPI_CR1_CPOL_Pos)

#define    FL_SPI_PHASE_EDGE1                                     (0x0U << SPI_CR1_CPHA_Pos)
#define    FL_SPI_PHASE_EDGE2                                     (0x1U << SPI_CR1_CPHA_Pos)

