zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_spi.h
#define    FL_SPI_DATAH_WIDTH0                                    (0x0U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH1                                    (0x1U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH2                                    (0x2U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH3                                    (0x3U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH4                                    (0x4U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH5                                    (0x5U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH6                                    (0x6U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_WIDTH7                                    (0x7U << SPI_CR2_DLEN2_Pos)


#define    FL_SPI_DATAL_WIDTH0                                    (0x0U << SPI_CR2_DLEN_Pos)
#define    FL_SPI_DATAL_WIDTH1                                    (0x1U << SPI_CR2_DLEN_Pos)
#define    FL_SPI_DATAL_WIDTH2                                    (0x2U << SPI_CR2_DLEN_Pos)
#define    FL_SPI_DATAL_WIDTH3                                    (0x3U << SPI_CR2_DLEN_Pos)

#define    FL_SPI_TRANSFER_MODE_FULL_DUPLEX                       (0x0U << SPI_CR2_HALFDUPLEX_Pos)
#define    FL_SPI_TRANSFER_MODE_HALF_DUPLEX                       (0x1U << SPI_CR2_HALFDUPLEX_Pos)

#define    FL_SPI_HALF_DUPLEX_TX                                  (0x0U << SPI_CR2_HD_RW_Pos)
#define    FL_SPI_HALF_DUPLEX_RX                                  (0x1U << SPI_CR2_HD_RW_Pos)

#define    FL_SPI_HALF_DUPLEX_CMDLEN_DLEN                         (0x0U << SPI_CR2_CMD8B_Pos)
#define    FL_SPI_HALF_DUPLEX_CMDLEN_8B                           (0x1U << SPI_CR2_CMD8B_Pos)

#define    FL_SPI_HALFDUPLEX_CMDLEN_DLEN                          (0x0U << SPI_CR2_CMD8B_Pos)
#define    FL_SPI_HALFDUPLEX_CMDLEN_8B                            (0x1U << SPI_CR2_CMD8B_Pos)

#define    FL_SPI_HARDWARE_SSN_KEEP_LOW                           (0x0U << SPI_CR2_SSNM_Pos)
#define    FL_SPI_HARDWARE_SSN_AUTO_HIGH                          (0x1U << SPI_CR2_SSNM_Pos)

#define    FL_SPI_SSN_LOW                                         (0x0U << SPI_CR2_SSN_Pos)
#define    FL_SPI_SSN_HIGH                                        (0x1U << SPI_CR2_SSN_Pos)

#define    FL_SPI_FRAME_MODE_CMD                                  (0x0U << SPI_ISR_DCN_TX_Pos)
#define    FL_SPI_FRAME_MODE_DATA                                 (0x1U << SPI_ISR_DCN_TX_Pos)

#define    FL_SPI_VOCAL_TRACT_LEFT                                (0x0U << SPI_ISR_CHSIDE_Pos)
#define    FL_SPI_VOCAL_TRACT_RIGHT                               (0x1U << SPI_ISR_CHSIDE_Pos)



#define    I2S_IER_SSNRFIE_Pos                                (5U)
#define    I2S_IER_SSNRIE_Msk                                 (0x1U << I2S_IER_SSNRFIE_Pos)
#define    I2S_IER_SSNRFIE                                    I2S_IER_SSNRIE_Msk

#define    I2S_IER_SSNFIE_Pos                                 (4U)
#define    I2S_IER_SSNFIE_Msk                                 (0x1U << I2S_IER_SSNFIE_Pos)
#define    I2S_IER_SSNFIE                                     I2S_IER_SSNFIE_Msk

#define    I2S_IER_TXSEIE_Pos                                 (3U)
#define    I2S_IER_TXSEIE_Msk                                 (0x1U << I2S_IER_TXSEIE_Pos)
#define    I2S_IER_TXSEIE                                     I2S_IER_TXSEIE_Msk

#define    I2S_IER_ERRIE_Pos                                  (2U)
#define    I2S_IER_ERRIE_Msk                                  (0x1U << I2S_IER_ERRIE_Pos)
#define    I2S_IER_ERRIE                                      I2S_IER_ERRIE_Msk

#define    I2S_IER_TXBEIE_Pos                                 (1U)
#define    I2S_IER_TXBEIE_Msk                                 (0x1U << I2S_IER_TXBEIE_Pos)
#define    I2S_IER_TXBEIE                                     I2S_IER_TXBEIE_Msk

#define    I2S_IER_RXIE_Pos                                   (0U)
#define    I2S_IER_RXIE_Msk                                   (0x1U << I2S_IER_RXIE_Pos)
#define    I2S_IER_RXIE                                       I2S_IER_RXIE_Msk

#define    I2S_ISR_DCN_TX_Pos                                 (12U)
#define    I2S_ISR_DCN_TX_Msk                                 (0x1U << I2S_ISR_DCN_TX_Pos)
#define    I2S_ISR_DCN_TX                                     I2S_ISR_DCN_TX_Msk

#define    I2S_ISR_RXCOL_Pos                                  (10U)
#define    I2S_ISR_RXCOL_Msk                                  (0x1U << I2S_ISR_RXCOL_Pos)
#define    I2S_ISR_RXCOL                                      I2S_ISR_RXCOL_Msk

#define    I2S_ISR_TXCOL_Pos                                  (9U)
#define    I2S_ISR_TXCOL_Msk                                  (0x1U << I2S_ISR_TXCOL_Pos)
#define    I2S_ISR_TXCOL                                      I2S_ISR_TXCOL_Msk

#define    I2S_ISR_BUSY_Pos                                   (8U)
#define    I2S_ISR_BUSY_Msk                                   (0x1U << I2S_ISR_BUSY_Pos)
#define    I2S_ISR_BUSY                                       I2S_ISR_BUSY_Msk

#define    I2S_ISR_CHSIDE_Pos                                 (7U)
#define    I2S_ISR_CHSIDE_Msk                                 (0x1U << I2S_ISR_CHSIDE_Pos)
#define    I2S_ISR_CHSIDE                                     I2S_ISR_CHSIDE_Msk

#define    I2S_ISR_MERR_Pos                                   (6U)
#define    I2S_ISR_MERR_Msk                                   (0x1U << I2S_ISR_MERR_Pos)
#define    I2S_ISR_MERR                                       I2S_ISR_MERR_Msk

#define    I2S_ISR_SERR_Pos                                   (5U)
#define    I2S_ISR_SERR_Msk                                   (0x1U << I2S_ISR_SERR_Pos)
#define    I2S_ISR_SERR                                       I2S_ISR_SERR_Msk

#define    I2S_ISR_SSNR_Pos                                   (4U)
#define    I2S_ISR_SSNR_Msk                                   (0x1U << I2S_ISR_SSNR_Pos)
#define    I2S_ISR_SSNR                                       I2S_ISR_SSNR_Msk

#define    I2S_ISR_SSNF_Pos                                   (3U)
#define    I2S_ISR_SSNF_Msk                                   (0x1U << I2S_ISR_SSNF_Pos)
#define    I2S_ISR_SSNF                                       I2S_ISR_SSNF_Msk

#define    I2S_ISR_TXSE_Pos                                   (2U)
#define    I2S_ISR_TXSE_Msk                                   (0x1U << I2S_ISR_TXSE_Pos)
#define    I2S_ISR_TXSE                                       I2S_ISR_TXSE_Msk

