zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_spi.h
/**
  * @brief    Disable I2S Slave SSN Rise Interrupt
  * @rmtoll   IER    SSNRIE    FL_I2S_DisableIT_SlaveSSNRise
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableIT_SlaveSSNRise(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, I2S_IER_SSNRIE_Msk);
}

/**
  * @brief    Enable I2S Slave SSN Rise Interrupt
  * @rmtoll   IER    SSNRIE    FL_I2S_EnableIT_SlaveSSNRise
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableIT_SlaveSSNRise(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, I2S_IER_SSNRIE_Msk);
}

/**
  * @brief    Get I2S Slave SSN Rise Interrupt Enable Status
  * @rmtoll   IER    SSNRIE    FL_I2S_IsEnabledIT_SlaveSSNRise
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledIT_SlaveSSNRise(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, I2S_IER_SSNRIE_Msk) == I2S_IER_SSNRIE_Msk);
}

/**
  * @brief    Disable I2S Slave SSN Fall Interrupt
  * @rmtoll   IER    SSNFIE    FL_I2S_DisableIT_SlaveSSNFall
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableIT_SlaveSSNFall(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, I2S_IER_SSNFIE_Msk);
}

/**
  * @brief    Enable I2S Slave SSN Fall Interrupt
  * @rmtoll   IER    SSNFIE    FL_I2S_EnableIT_SlaveSSNFall
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableIT_SlaveSSNFall(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, I2S_IER_SSNFIE_Msk);
}

/**
  * @brief    Get I2S Slave SSN Fall Interrupt Enable Status
  * @rmtoll   IER    SSNFIE    FL_I2S_IsEnabledIT_SlaveSSNFall
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledIT_SlaveSSNFall(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, I2S_IER_SSNFIE_Msk) == I2S_IER_SSNFIE_Msk);
}

/**
  * @brief    Disable I2S Transmit Shift Empty Interrupt
  * @rmtoll   IER    TXSEIE    FL_I2S_DisableIT_TXShiftEmptyComplete
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableIT_TXShiftEmptyComplete(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, I2S_IER_TXSEIE_Msk);
}

/**
  * @brief    Enable I2S Transmit Shift Empty Interrupt
  * @rmtoll   IER    TXSEIE    FL_I2S_EnableIT_TXShiftEmptyComplete
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableIT_TXShiftEmptyComplete(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, I2S_IER_TXSEIE_Msk);
}

/**
  * @brief    Get I2S Transmit Shift Empty Interrupt Enable Status
  * @rmtoll   IER    TXSEIE    FL_I2S_IsEnabledIT_TXShiftEmptyComplete
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledIT_TXShiftEmptyComplete(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, I2S_IER_TXSEIE_Msk) == I2S_IER_TXSEIE_Msk);
}

/**
  * @brief    Disable I2S Error Interrupt
  * @rmtoll   IER    ERRIE    FL_I2S_DisableIT_Error
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableIT_Error(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, I2S_IER_ERRIE_Msk);
}

/**
  * @brief    Enable I2S Error Interrupt
  * @rmtoll   IER    ERRIE    FL_I2S_EnableIT_Error
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableIT_Error(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, I2S_IER_ERRIE_Msk);
}

/**
  * @brief    Get I2S Error Interrupt Enable Status
  * @rmtoll   IER    ERRIE    FL_I2S_IsEnabledIT_Error
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledIT_Error(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, I2S_IER_ERRIE_Msk) == I2S_IER_ERRIE_Msk);
}

/**
  * @brief    Disable I2S Transmit Buffer Empty Interrupt
  * @rmtoll   IER    TXBEIE    FL_I2S_DisableIT_TXBufferEmptyComplete
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableIT_TXBufferEmptyComplete(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, I2S_IER_TXBEIE_Msk);
}

/**
  * @brief    Enable I2S Transmit Buffer Empty Interrupt
  * @rmtoll   IER    TXBEIE    FL_I2S_EnableIT_TXBufferEmptyComplete
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableIT_TXBufferEmptyComplete(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, I2S_IER_TXBEIE_Msk);
}

/**
  * @brief    Get I2S Transmit Buffer Empty Interrupt Enable Status
  * @rmtoll   IER    TXBEIE    FL_I2S_IsEnabledIT_TXBufferEmptyComplete
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledIT_TXBufferEmptyComplete(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, I2S_IER_TXBEIE_Msk) == I2S_IER_TXBEIE_Msk);
}

/**
  * @brief    Disable I2S Receive Complete Interrupt
  * @rmtoll   IER    RXIE    FL_I2S_DisableIT_RXComplete
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableIT_RXComplete(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, I2S_IER_RXIE_Msk);
}

/**
  * @brief    Enable I2S Receive Complete Interrupt
  * @rmtoll   IER    RXIE    FL_I2S_EnableIT_RXComplete
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableIT_RXComplete(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, I2S_IER_RXIE_Msk);
}

/**
  * @brief    Get I2S Receive Complete Interrupt Enable Status
  * @rmtoll   IER    RXIE    FL_I2S_IsEnabledIT_RXComplete
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledIT_RXComplete(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, I2S_IER_RXIE_Msk) == I2S_IER_RXIE_Msk);
}

/**
  * @brief    Set I2S Output Data/Command Under Half-Duplex Mode
  * @rmtoll   ISR    DCN_TX    FL_I2S_SetFrameMode
  * @param    I2Sx I2S instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_I2S_FRAME_MODE_CMD
  *           @arg @ref FL_I2S_FRAME_MODE_DATA
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetFrameMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->ISR, I2S_ISR_DCN_TX_Msk, mode);
}

/**
  * @brief    Get I2S Output Data/Command Under Half-Duplex Mode Setting
  * @rmtoll   ISR    DCN_TX    FL_I2S_GetFrameMode
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_FRAME_MODE_CMD
  *           @arg @ref FL_I2S_FRAME_MODE_DATA
  */
__STATIC_INLINE uint32_t FL_I2S_GetFrameMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_DCN_TX_Msk));
}

/**
  * @brief    Get I2S Receive Collision Flag
  * @rmtoll   ISR    RXCOL    FL_I2S_IsActiveFlag_RXBuffOverflow
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_RXBuffOverflow(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_RXCOL_Msk) == (I2S_ISR_RXCOL_Msk));
}

/**
  * @brief    Clear I2S Receive Collision Flag
  * @rmtoll   ISR    RXCOL    FL_I2S_ClearFlag_RXBuffOverflow
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_ClearFlag_RXBuffOverflow(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, I2S_ISR_RXCOL_Msk);
}

/**
  * @brief    Get I2S Transmit Collision Flag
  * @rmtoll   ISR    TXCOL    FL_I2S_IsActiveFlag_TXBuffOverflow
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_TXBuffOverflow(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_TXCOL_Msk) == (I2S_ISR_TXCOL_Msk));
}

/**
  * @brief    Clear I2S Transmit Collision Flag
  * @rmtoll   ISR    TXCOL    FL_I2S_ClearFlag_TXBuffOverflow
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_ClearFlag_TXBuffOverflow(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, I2S_ISR_TXCOL_Msk);
}

/**
  * @brief    Get I2S Busy Flag
  * @rmtoll   ISR    BUSY    FL_I2S_IsActiveFlag_Busy
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_Busy(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_BUSY_Msk) == (I2S_ISR_BUSY_Msk));
}

/**
  * @brief    Get I2S Vocal Tract Flag
  * @rmtoll   ISR    CHSIDE    FL_I2S_GetVocalTract
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_VOCAL_TRACT_LEFT
  *           @arg @ref FL_I2S_VOCAL_TRACT_RIGHT
  */
__STATIC_INLINE uint32_t FL_I2S_GetVocalTract(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_CHSIDE_Msk) == (I2S_ISR_CHSIDE_Msk));
}

/**
  * @brief    Get I2S Master Error Flag
  * @rmtoll   ISR    MERR    FL_I2S_IsActiveFlag_MasterError
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_MasterError(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_MERR_Msk) == (I2S_ISR_MERR_Msk));
}

/**
  * @brief    Get I2S Slave Error Flag
  * @rmtoll   ISR    SERR    FL_I2S_IsActiveFlag_SlaveError
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_SlaveError(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_SERR_Msk) == (I2S_ISR_SERR_Msk));
}

/**
  * @brief    Get I2S Slave SSN Rise Flag
  * @rmtoll   ISR    SSNR    FL_I2S_IsActiveFlag_SlaveSSNRise
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_SlaveSSNRise(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_SSNR_Msk) == (I2S_ISR_SSNR_Msk));
}

/**
  * @brief    Clear I2S Slave SSN Rise Flag
  * @rmtoll   ISR    SSNR    FL_I2S_ClearFlag_SlaveSSNRise
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_ClearFlag_SlaveSSNRise(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, I2S_ISR_SSNR_Msk);
}

/**
  * @brief    Get I2S Slave SSN Fall Flag
  * @rmtoll   ISR    SSNF    FL_I2S_IsActiveFlag_SlaveSSNFall
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_SlaveSSNFall(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_SSNF_Msk) == (I2S_ISR_SSNF_Msk));
}

/**
  * @brief    Clear I2S Slave SSN Fall Flag
  * @rmtoll   ISR    SSNF    FL_I2S_ClearFlag_SlaveSSNFall
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_ClearFlag_SlaveSSNFall(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, I2S_ISR_SSNF_Msk);
}

/**
  * @brief    Get I2S TX Shift Empty Flag
  * @rmtoll   ISR    TXSE    FL_I2S_IsActiveFlag_TXShiftEmpty
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_TXShiftEmpty(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_TXSE_Msk) == (I2S_ISR_TXSE_Msk));
}

/**
  * @brief    Clear TX Shift Empty Flag
  * @rmtoll   ISR    TXSE    FL_I2S_ClearFlag_TXShiftEmpty
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_ClearFlag_TXShiftEmpty(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, I2S_ISR_TXSE_Msk);
}

/**
  * @brief    Get I2S TX Buffer Empty Flag
  * @rmtoll   ISR    TXBE    FL_I2S_IsActiveFlag_TXBuffEmpty
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_TXBuffEmpty(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_TXBE_Msk) == (I2S_ISR_TXBE_Msk));
}

/**
  * @brief    Get I2S RX Buffer Full Flag
  * @rmtoll   ISR    RXBF    FL_I2S_IsActiveFlag_RXBuffFull
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsActiveFlag_RXBuffFull(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, I2S_ISR_RXBF_Msk) == (I2S_ISR_RXBF_Msk));
}

/**
  * @brief    Write I2S TX Buffer
  * @rmtoll   TXBUF        FL_I2S_WriteTXBuff
  * @param    I2Sx I2S instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_WriteTXBuff(SPI_Type *SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->TXBUF, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Read I2S TX Buffer
  * @rmtoll   RXBUF        FL_I2S_ReadRXBuff
  * @param    I2Sx I2S instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2S_ReadRXBuff(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->RXBUF, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set I2S Standard
  * @rmtoll   I2SCR    I2SSTD    FL_I2S_SetStandardMode
  * @param    I2Sx I2S instance
  * @param    standard This parameter can be one of the following values:
  *           @arg @ref FL_I2S_STANDARD_MODE_PHILIPS
  *           @arg @ref FL_I2S_STANDARD_MODE_MSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_LSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_PCM
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetStandardMode(SPI_Type *SPIx, uint32_t standard)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_I2SSTD_Msk, standard);
}

/**
  * @brief    Get I2S Standard
  * @rmtoll   I2SCR    I2SSTD    FL_I2S_GetStandardMode
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_STANDARD_MODE_PHILIPS
  *           @arg @ref FL_I2S_STANDARD_MODE_MSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_LSB_JUSTIFIED
  *           @arg @ref FL_I2S_STANDARD_MODE_PCM
  */
__STATIC_INLINE uint32_t FL_I2S_GetStandardMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_I2SSTD_Msk));
}

/**
  * @brief    Set I2S Vocal Tract Length
  * @rmtoll   I2SCR    CHLEN    FL_I2S_SetVocalTractLength
  * @param    I2Sx I2S instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_16BITS
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_32BITS
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetVocalTractLength(SPI_Type *SPIx, uint32_t length)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_CHLEN_Msk, length);
}

/**
  * @brief    Get I2S Vocal Tract Length
  * @rmtoll   I2SCR    CHLEN    FL_I2S_GetVocalTractLength
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_16BITS
  *           @arg @ref FL_I2S_VOCAL_TRACT_LENGTH_32BITS
  */
__STATIC_INLINE uint32_t FL_I2S_GetVocalTractLength(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_CHLEN_Msk));
}

/**
  * @brief    Set I2S Idle Clock Polarity
  * @rmtoll   I2SCR    CKPOL    FL_I2S_SetIdleClockPolarity
  * @param    I2Sx I2S instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_I2S_IDLE_POLARITY_LOW
  *           @arg @ref FL_I2S_IDLE_POLARITY_HIGHT
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetIdleClockPolarity(SPI_Type *SPIx, uint32_t polarity)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_CKPOL_Msk, polarity);
}

/**
  * @brief    Get I2S Idle Clock Polarity
  * @rmtoll   I2SCR    CKPOL    FL_I2S_GetIdleClockPolarity
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_IDLE_POLARITY_LOW
  *           @arg @ref FL_I2S_IDLE_POLARITY_HIGHT
  */
__STATIC_INLINE uint32_t FL_I2S_GetIdleClockPolarity(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_CKPOL_Msk));
}

/**
  * @brief    Set I2S Data Length
  * @rmtoll   I2SCR    DLEN    FL_I2S_SetDataLength
  * @param    I2Sx I2S instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_I2S_DATA_LENGTH_16BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_24BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_32BITS
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetDataLength(SPI_Type *SPIx, uint32_t length)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_DLEN_Msk, length);
}

/**
  * @brief    Get I2S Data Length
  * @rmtoll   I2SCR    DLEN    FL_I2S_GetDataLength
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_DATA_LENGTH_16BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_24BITS
  *           @arg @ref FL_I2S_DATA_LENGTH_32BITS
  */
__STATIC_INLINE uint32_t FL_I2S_GetDataLength(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_DLEN_Msk));
}

/**
  * @brief    Set I2S PCM Frame Synchronization
  * @rmtoll   I2SCR    PCMSYNC    FL_I2S_SetPCMFrameSynchronization
  * @param    I2Sx I2S instance
  * @param    Synchronization This parameter can be one of the following values:
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_SHORT
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_LONG
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetPCMFrameSynchronization(SPI_Type *SPIx, uint32_t Synchronization)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_PCMSYNC_Msk, Synchronization);
}

/**
  * @brief    Get II2S PCM Frame Synchronization
  * @rmtoll   I2SCR    PCMSYNC    FL_I2S_GetIPCMFrameSynchronization
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_SHORT
  *           @arg @ref FL_I2S_FRAME_SYNCHRONIZATION_LONG
  */
__STATIC_INLINE uint32_t FL_I2S_GetIPCMFrameSynchronization(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_PCMSYNC_Msk));
}

/**
  * @brief    Set I2S Master Mode
  * @rmtoll   I2SCR    I2SMM    FL_I2S_SetTransferMode
  * @param    I2Sx I2S instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_I2S_MODE_SLAVE_RX
  *           @arg @ref FL_I2S_MODE_SLAVE_TX
  *           @arg @ref FL_I2S_MODE_MASTER_RX
  *           @arg @ref FL_I2S_MODE_MASTER_TX
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetTransferMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_I2SMM_Msk, mode);
}

/**
  * @brief    Get I2S Data LengthMaster Mode
  * @rmtoll   I2SCR    I2SMM    FL_I2S_GetTransferMode
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_MODE_SLAVE_RX
  *           @arg @ref FL_I2S_MODE_SLAVE_TX
  *           @arg @ref FL_I2S_MODE_MASTER_RX
  *           @arg @ref FL_I2S_MODE_MASTER_TX
  */
__STATIC_INLINE uint32_t FL_I2S_GetTransferMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_I2SMM_Msk));
}

/**
  * @brief    Enable I2S Data Delay
  * @rmtoll   I2SCR    DLYEN    FL_I2S_EnableDataDelay
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableDataDelay(SPI_Type *SPIx)
{
    SET_BIT(SPIx->I2SCR, I2SCR_DLYEN_Msk);
}

/**
  * @brief    Get I2S Data Delay Status
  * @rmtoll   I2SCR    DLYEN    FL_I2S_IsEnabledDataDelay
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledDataDelay(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_DLYEN_Msk) == I2SCR_DLYEN_Msk);
}

/**
  * @brief    Disable I2S Data Delay
  * @rmtoll   I2SCR    DLYEN    FL_I2S_DisableDataDelay
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableDataDelay(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->I2SCR, I2SCR_DLYEN_Msk);
}

/**
  * @brief    Set PeripheralMode
  * @rmtoll   I2SCR    I2SMOD    FL_I2S_SetPeriphralMode
  * @param    I2Sx I2S instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_SPI
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_I2S
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetPeriphralMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->I2SCR, I2SCR_I2SMOD_Msk, mode);
}

/**
  * @brief    Get PeripheralMode
  * @rmtoll   I2SCR    I2SMOD    FL_I2S_GetPeriphralMode
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_SPI
  *           @arg @ref FL_I2S_PERIPHRAL_MODE_I2S
  */
__STATIC_INLINE uint32_t FL_I2S_GetPeriphralMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_I2SMOD_Msk));
}

/**
  * @brief    Enable I2S
  * @rmtoll   I2SCR    I2SEN    FL_I2S_Enable
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_Enable(SPI_Type *SPIx)
{
    SET_BIT(SPIx->I2SCR, I2SCR_I2SEN_Msk);
}

/**
  * @brief    Get I2S Enable Status
  * @rmtoll   I2SCR    I2SEN    FL_I2S_IsEnabled
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabled(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SCR, I2SCR_I2SEN_Msk) == I2SCR_I2SEN_Msk);
}

/**
  * @brief    Disable I2S
  * @rmtoll   I2SCR    I2SEN    FL_I2S_Disable
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_Disable(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->I2SCR, I2SCR_I2SEN_Msk);
}

/**
  * @brief    Enable I2S Master Clock Output
  * @rmtoll   I2SPR    MCKOE    FL_I2S_EnableMasterClockOutput
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_EnableMasterClockOutput(SPI_Type *SPIx)
{
    SET_BIT(SPIx->I2SPR, I2SPR_MCKOE_Msk);
}

/**
  * @brief    Get I2S Master Clock Output
  * @rmtoll   I2SPR    MCKOE    FL_I2S_IsEnabledMasterClockOutput
  * @param    I2Sx I2S instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_I2S_IsEnabledMasterClockOutput(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SPR, I2SPR_MCKOE_Msk) == I2SPR_MCKOE_Msk);
}

/**
  * @brief    Disable I2S Master Clock Output
  * @rmtoll   I2SPR    MCKOE    FL_I2S_DisableMasterClockOutput
  * @param    I2Sx I2S instance
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_DisableMasterClockOutput(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->I2SPR, I2SPR_MCKOE_Msk);
}

/**
  * @brief    Set I2S BaudRate Prescale Fractional
  * @rmtoll   I2SPR    ODD    FL_I2S_SetPrescalerParity
  * @param    I2Sx I2S instance
  * @param    prescalerParity This parameter can be one of the following values:
  *           @arg @ref FL_I2S_PRESCALER_PARITY_EVEN
  *           @arg @ref FL_I2S_PRESCALER_PARITY_ODD
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_SetPrescalerParity(SPI_Type *SPIx, uint32_t prescalerParity)
{
    MODIFY_REG(SPIx->I2SPR, I2SPR_ODD_Msk, prescalerParity);
}

/**
  * @brief    Get I2S BaudRate Prescale Fractiona
  * @rmtoll   I2SPR    ODD    FL_I2S_GetPrescalerParity
  * @param    I2Sx I2S instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_I2S_PRESCALER_PARITY_EVEN
  *           @arg @ref FL_I2S_PRESCALER_PARITY_ODD
  */
__STATIC_INLINE uint32_t FL_I2S_GetPrescalerParity(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SPR, I2SPR_ODD_Msk));
}

/**
  * @brief    Write I2S BaudRate Prescale
  * @rmtoll   I2SPR    CLKDIV    FL_I2S_WritePrescalerLinear
  * @param    I2Sx I2S instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_I2S_WritePrescalerLinear(SPI_Type *SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->I2SPR, (0xffU << 0U), (data << 0U));
}

/**
  * @brief    Read I2S BaudRate Prescale
  * @rmtoll   I2SPR    CLKDIV    FL_I2S_ReadPrescalerLinear
  * @param    I2Sx I2S instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_I2S_ReadPrescalerLinear(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->I2SPR, (0xffU << 0U)) >> 0U);
}


/**
  * @}
  */

/** @defgroup SPI_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_SPI_DeInit(SPI_Type *SPIx);
FL_ErrorStatus FL_SPI_Init(SPI_Type *SPIx, FL_SPI_InitTypeDef *initStruct);
void FL_SPI_StructInit(FL_SPI_InitTypeDef *initStruct);
FL_ErrorStatus FL_I2S_Init(SPI_Type *SPIx, FL_I2S_InitTypeDef *initStruct);
void FL_I2S_StructInit(FL_I2S_InitTypeDef *initStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XXA_FL_SPI_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-03-27*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
